Revit 2024 API
RebarUpdateCurvesData.GetLayoutRule Method
 Gets the layout rule for this bar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public RebarLayoutRule GetLayoutRule()
Visual Basic
Public Function GetLayoutRule As RebarLayoutRule
Visual C++
public:
RebarLayoutRule GetLayoutRule()
Return Value
 Returns the layout rule for this bar.
See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace